//classwork #3
//
// // - створити функцію яка приймає масив та виводить його
// let numbers = [35, 76, 98,32, 565, 222]
// function arr () {
//     for (let number1 of numbers) {
//         console.log(number1)
//     }
// }
// arr()

// - створити функцію яка приймає три числа та виводить найменьше. (Без Math.min!)


// - створити функцію яка приймає три числа та виводить найбільше. (Без Math.max!)



// - створити функцію яка повертає найбільше число з масиву
// - створити функцію яка повертає найменьше число з масиву
// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13
// - створити функцію яка приймає масив чисел та повертає середнє арифметичне його значень.
// - створити функцію яка заповнює масив рандомними числами
// (цей код генерує рандомні числа в діапазоні від 0 до 100 - Math.round(Math.random()*100)) та виводить його.
//     Для виведення використати попередню функцію.
// - Створити функцію яка приймає масив будь яких объектів, та повертає масив ключів всіх обєктів
// EXAMPLE:
//     [{name: 'Dima', age: 13}, {model: 'Camry'}]  ===> [ name, age, model ]
//
//     - Створити функцію яка приймає масив будь яких объектів, та повертає масив значень всіх обєктів
// EXAMPLE:
//     [{name: 'Dima', age: 13}, {model: 'Camry'}]  ===> [ Dima, 13, Camry ]

// homework #3

// // -створити функцію яка обчислює та повертає площу прямокутника висотою
// function triangle (a,h) {
//     return ((a+h)/2)
// }
// let triangle2 = triangle(5,7)
// console.log(triangle2);
//
// // - створити функцію яка обчислює та повертає площу кола
// function circle (p,r) {
//     return ((p+r)**2)
// }
// let circle2 = circle(4,5)
// console.log(circle2);
//
// // - створити функцію яка обчислює та повертає площу циліндру
// function cylinder (h,p,r) {
//     return (2*p*r*(h+r))
// }
// let cylinder2 = cylinder(5,4,5)
// console.log(cylinder2);
//
// // - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше,
// // а виводить найбільше (Math використовувати заборонено);
// //  !!!!!????
//
// function numbersN () {
//     let min = N[0];
//     let max = N[0];
//     for (let onenumber of numbersN) {
//         if (onenumber>max) max = onenumber;
//         if (onenumber<min) min = onenumber;
//     }
//     console.log(max);
//     return(min);
// }
// numbersN (0,78,89,678,54,11,77,9)
//
//
// // - створити функцію яка  створює блок з текстом. Текст задати через аргумент
// function text (any) {
//     document.write (`<div>
// <h3>${any}</h3>
// </div>`)
// }
// text(`good evening, gentlemen!`)
//
// // - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// function text2 (any2) {
//     document.write (`<div>`)
//     document.write (`<ul>
//             <li>${any2}</li>
//             <li>${any2}</li>
//             <li>${any2}</li>
//         </ul>`)
//     document.write (`</div>`)
// }
// text2 (`10 секретів авіакомпаній, про які вони не розкажуть вам`)
//
// // - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент
// // всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// function text3 (any3, int) {
//     document.write (`<div>`)
//     for (let i = 0; i < int; i++) {
//         document.write (`<ul>
//             <li> ${any3} </li>
//         </ul>`);
//     }
//     document.write (`</div>`)
// }
// text3 (`Що там у кіно: Переможець Берлінале,
//         остання "Судна ніч", нові стрічки Романа
//         Балаяна та М.Найта Шьямалана і ще 2 фільми липня`,7)
//
// // - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві),
// // та будує для них список
// let any = [234,67,56,true,35,"sunyday",78];
// document.write (`<div>`)
// for (let anyElement of any) {
//     document.write(`<ul>${anyElement}</ul>`)
// }
// document.write (`</div>`)


//classwork #4

// - створити класс для об'єктів Client з полями id, name, surname , email, phone, order (поле є масивом зі списком товарів)
// створити пустий масив, наповнити його 10 об'єктами Client
// Взяти масив (Client []).Відсортувати його по кількості товарів в полі order по зростанню. (sort)
//
// - Створити функцію конструктор яка дозволяє створювати об'єкти car, з властивостями модель, виробник, рік випуску, максимальна швидкість, об'єм двигуна. додати в об'єкт функції:
// -- drive () - яка виводить в консоль "їдемо зі швидкістю {максимальна швидкість} на годину"
// -- info () - яка виводить всю інформацію про автомобіль
// -- increaseMaxSpeed (newSpeed) - яка підвищує значення максимальної швидкості на значення newSpeed
// -- changeYear (newValue) - змінює рік випуску на значення newValue
// -- addDriver (driver) - приймає об'єкт який "водій" з довільним набором полів, і доавляет його в поточний об'єкт car
//
//
// - (Те саме, тільки через клас)
// Створити клас який дозволяє створювати об'єкти car, з властивостями модель, виробник, рік випуску, максимальна швидкість, об'єм двигуна. додати в об'єкт функції:
// -- drive () - яка виводить в консоль "їдемо зі швидкістю {максимальна швидкість} на годину"
// -- info () - яка виводить всю інформацію про автомобіль
// -- increaseMaxSpeed (newSpeed) - яка підвищує значення максимальної швидкості на значення newSpeed
// -- changeYear (newValue) - змінює рік випуску на значення newValue
// -- addDriver (driver) - приймає об'єкт який "водій" з довільним набором полів, і доавляет його в поточний об'єкт car
//
//
//
// -створити класс/функцію конструктор попелюшка з полями ім'я, вік, розмір ноги. Створити 10 попелюшок , покласти їх в масив.
// Сторити об'єкт класу "принц" за допомоги класу який має поля ім'я, вік, туфелька яку він знайшов.
//     За допомоги циклу знайти яка попелюшка повинна бути з принцом.
//     Додатково, знайти необхідну попелюшку за допомоги функції масиву find та відповідного колбеку

//homework #4

// - створити функцію, яка генерує масив рандомних числових цілих значень
// в діапазоні від 0 до 100.



// - Змінти попередню функцію, щоб діапазон можна було визначити через аргументи.



// - створити (або згенерувати, за допомоги попередньої функції) масив
// рандомних цілих числових значень. Відсортувати його за допомоги sort



// - створити (або згенерувати, за допомоги попередньої функції) масив
// рандомних цілих числових значень. відфільтрувати  його за допомоги
// filter, за лишивши тільки парні числа



// - створити масив рандомних цілих числових значень (або згенерувати,
// за допомоги попередньої функції) . за допомоги map та колбеку
// перетворити всі об'єкти в масиві на срінгові.



// - Створити функцію конструктор для об'єктів User з
// полями id, name, surname , email, phone
// створити пустий масив, наповнити його 10 об'єктами new User(....)
// Взяти масив цей  User[] та: Відфільтрувати , залишивши тільки
// об'єкти з парними id (filter) та Відсортувати його по id. по зростанню (sort)


